#### Terraform checks in directory 'deploy/terraform/micro1'
#### Terraform Initialization ⚙️`success`            
#### Terraform Plan 📖`
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_ecrpublic_repository.repoTest1[0m will be created
[0m  [32m+[0m[0m resource "aws_ecrpublic_repository" "repoTest1" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m force_destroy   = false
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m registry_id     = (known after apply)
      [32m+[0m[0m repository_name = "repo-test-micro1"
      [32m+[0m[0m repository_uri  = (known after apply)
      [32m+[0m[0m tags_all        = (known after apply)
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mVersion constraints inside provider configuration blocks are deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  on main.tf line 2, in provider "aws":
[33m│[0m [0m   2:   version = [4m"5.44.0"[0m[0m
[33m│[0m [0m
[33m│[0m [0mTerraform 0.13 and earlier allowed provider version constraints inside the
[33m│[0m [0mprovider configuration block, but that is now deprecated and will be
[33m│[0m [0mremoved in a future version of Terraform. To silence this warning, move the
[33m│[0m [0mprovider version constraint into the required_providers block.
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
`

*Pusher: @sebasarangom, Action: `pull_request`*